package main.nini.com.iread.bean;

/**
 * Created by zyf on 2017/2/25.
 */

public class BContentBean {

    /**
     * ok : true
     * chapter : {"title":"第3章 相遇(1)","body":"\n\r\n\r\n\r请安装最新版追书 以便使用优质资源","isVip":false,"cpContent":"\u201c哎，真是怪了。\u201d几个纨绔子弟甩甩脑袋，只当自己喝多了，瞪着那道越走越远的清瘦身影，面上颇为遗憾。\n\n这么一个美得刺目的人儿没能赶上认识，当真是可惜。\n\n顾惜瑾看着这些人的神情，握着酒杯的手微微泛白，从顾溪桥第一天回家的那天起，她就知道那人是个祸害，可左右不过长了一张脸而已，这世道长得好看的花瓶最终不过沦为别人的玩物。\n\n稍微一想，顾惜瑾便释然，可是黑沉的眼底依旧是散不去的阴霾。\n\n她身边的少女忍不住替她打抱不平，\u201c阿瑾，你这心也太大了吧，她就是你那位妹妹？一脸狐媚子样，一看就不是什么善茬，顾爷爷还真放心带回来。\u201d\n\n顾溪桥的来历在这些人眼里也不是什么秘密，大多数人都知道，她是一个艳星的后代，还是从乡下来的，整个人都带着一股土味儿，怕是琴棋书画的边儿都没摸过，一个名副其实的草包。\n\n\u201c怕什么，不过一个乡下来的傻妞儿，过不了几天就该让她知道N市跟她们那儿的泥巴团不一样！\u201d\n\n\u201c\u2026\u2026\u201d\n\n是的，N市跟她想的完全不一样，她已经用自己的生命领悟到这点了，顾溪桥扯了扯嘴角，目光讽刺地朝身后这幢辉煌的大楼看去，此时楼里突然一片混乱\u2014\u2014\n\n\u201c哎阿瑾，你衣服怎么了！\u201d\n\n\u201c啊\u2014\u2014\u201d一声刺耳惊恐的女声刺破了夜空。\n\n顾溪桥伸了个懒腰，眸光清冷，隔空爆衣，真是个不错的能力。\n\n路过的佣人都知道女主人接回了一个私生女，这个私生女不但不感恩，每天阴郁得就跟死了娘一样，真是晦气！他们嫌恶地看了这私生女一眼，便加快脚步朝屋里走去。\n\n这些人怎么会理解一个见不得光的私生女，突然出现在一个与她格格不入的地方，在被一大家子人刻意的排斥下，在这女主人处心积虑想弄死她的情况下，她处处小心，三观很正地活了下去她的心性该有多坚定。\n\n顾溪桥并不介意，她是个卑微的私生女，这些个佣人捧高踩低的做法她上辈子已经看得够多了，心底起不了半点涟漪。\n\n平静无波地出了那个让她喘不过气的地方。\n\n只是，她竟然回来了，回到了十八岁，这一年她刚回顾家。\n\n顾溪桥停下步子迫不及待地抬起双手，映入眼帘的手指修长葱白，虽然掌心有薄茧，却丝毫不损美感，这是一双完好的手，她忽然轻声笑了，并不是每个人都这么幸运的。\n\n刺眼的光芒蓦地从前方传来。\n\n【警告！前方三米处有危险，请于0。01秒内避让，或者使用1点积分购买一张闪避卡！】\n\n寂静闷热的夜晚传来一阵刺耳冗长的刹车声。\n\n司机匆忙地从车上下来，看见这小姑娘心里咯噔一声，他急着赶飞机，这条大道平日里罕无人迹，拐弯的时候也没想到路中间还有人，大惊之下踩了刹车，没想到还是撞到了。\n\n但是也不至于撞得这么厉害吧？而且车灯这么亮她都没躲开，莫不是刻意来碰瓷儿的？\n\n司机目光惊疑不定。\n\n顾溪桥缓过来了，她看清了司机的眼神，没说什么，慢慢爬起来，脸上清清冷冷的，没有半丝痛苦的表情。\n\n","currency":5,"id":"57bae90cac8736ef048e973f"}
     */

    private boolean ok;
    private ChapterBean chapter;

    public boolean isOk() {
        return ok;
    }

    public void setOk(boolean ok) {
        this.ok = ok;
    }

    public ChapterBean getChapter() {
        return chapter;
    }

    public void setChapter(ChapterBean chapter) {
        this.chapter = chapter;
    }

    public static class ChapterBean {
        /**
         * title : 第3章 相遇(1)
         * body :


         请安装最新版追书 以便使用优质资源
         * isVip : false
         * cpContent : “哎，真是怪了。”几个纨绔子弟甩甩脑袋，只当自己喝多了，瞪着那道越走越远的清瘦身影，面上颇为遗憾。

         这么一个美得刺目的人儿没能赶上认识，当真是可惜。

         顾惜瑾看着这些人的神情，握着酒杯的手微微泛白，从顾溪桥第一天回家的那天起，她就知道那人是个祸害，可左右不过长了一张脸而已，这世道长得好看的花瓶最终不过沦为别人的玩物。

         稍微一想，顾惜瑾便释然，可是黑沉的眼底依旧是散不去的阴霾。

         她身边的少女忍不住替她打抱不平，“阿瑾，你这心也太大了吧，她就是你那位妹妹？一脸狐媚子样，一看就不是什么善茬，顾爷爷还真放心带回来。”

         顾溪桥的来历在这些人眼里也不是什么秘密，大多数人都知道，她是一个艳星的后代，还是从乡下来的，整个人都带着一股土味儿，怕是琴棋书画的边儿都没摸过，一个名副其实的草包。

         “怕什么，不过一个乡下来的傻妞儿，过不了几天就该让她知道N市跟她们那儿的泥巴团不一样！”

         “……”

         是的，N市跟她想的完全不一样，她已经用自己的生命领悟到这点了，顾溪桥扯了扯嘴角，目光讽刺地朝身后这幢辉煌的大楼看去，此时楼里突然一片混乱——

         “哎阿瑾，你衣服怎么了！”

         “啊——”一声刺耳惊恐的女声刺破了夜空。

         顾溪桥伸了个懒腰，眸光清冷，隔空爆衣，真是个不错的能力。

         路过的佣人都知道女主人接回了一个私生女，这个私生女不但不感恩，每天阴郁得就跟死了娘一样，真是晦气！他们嫌恶地看了这私生女一眼，便加快脚步朝屋里走去。

         这些人怎么会理解一个见不得光的私生女，突然出现在一个与她格格不入的地方，在被一大家子人刻意的排斥下，在这女主人处心积虑想弄死她的情况下，她处处小心，三观很正地活了下去她的心性该有多坚定。

         顾溪桥并不介意，她是个卑微的私生女，这些个佣人捧高踩低的做法她上辈子已经看得够多了，心底起不了半点涟漪。

         平静无波地出了那个让她喘不过气的地方。

         只是，她竟然回来了，回到了十八岁，这一年她刚回顾家。

         顾溪桥停下步子迫不及待地抬起双手，映入眼帘的手指修长葱白，虽然掌心有薄茧，却丝毫不损美感，这是一双完好的手，她忽然轻声笑了，并不是每个人都这么幸运的。

         刺眼的光芒蓦地从前方传来。

         【警告！前方三米处有危险，请于0。01秒内避让，或者使用1点积分购买一张闪避卡！】

         寂静闷热的夜晚传来一阵刺耳冗长的刹车声。

         司机匆忙地从车上下来，看见这小姑娘心里咯噔一声，他急着赶飞机，这条大道平日里罕无人迹，拐弯的时候也没想到路中间还有人，大惊之下踩了刹车，没想到还是撞到了。

         但是也不至于撞得这么厉害吧？而且车灯这么亮她都没躲开，莫不是刻意来碰瓷儿的？

         司机目光惊疑不定。

         顾溪桥缓过来了，她看清了司机的眼神，没说什么，慢慢爬起来，脸上清清冷冷的，没有半丝痛苦的表情。


         * currency : 5
         * id : 57bae90cac8736ef048e973f
         */

        private String title;
        private String body;
        private boolean isVip;
        private String cpContent;
        private int currency;
        private String id;

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getBody() {
            return body;
        }

        public void setBody(String body) {
            this.body = body;
        }

        public boolean isIsVip() {
            return isVip;
        }

        public void setIsVip(boolean isVip) {
            this.isVip = isVip;
        }

        public String getCpContent() {
            return cpContent;
        }

        public void setCpContent(String cpContent) {
            this.cpContent = cpContent;
        }

        public int getCurrency() {
            return currency;
        }

        public void setCurrency(int currency) {
            this.currency = currency;
        }

        public String getId() {
            return id;
        }

        public void setId(String id) {
            this.id = id;
        }
    }
}
